In [1]:
import pandas as pd

# SERIES

In [2]:
data = [1,2,3,4,5]
s = pd.Series(data)

In [3]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
index = ['linha' + str(i) for i in range(5)]

In [5]:
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4']

In [6]:
s = pd.Series(data = data, index = index)

In [7]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [8]:
data = {'linha' + str(i) : i + 1 for i in range(5)}

In [9]:
s = pd.Series(data)

In [10]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [11]:
s1 = s + 2

In [12]:
s1

linha0    3
linha1    4
linha2    5
linha3    6
linha4    7
dtype: int64

In [13]:
s2 = s + s1

In [14]:
s2

linha0     4
linha1     6
linha2     8
linha3    10
linha4    12
dtype: int64

In [15]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]

In [16]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [21]:
df1 = pd.DataFrame(data = data)

In [22]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
index = ['Linha' + str(i) for i in range(3)]

In [24]:
index

['Linha0', 'Linha1', 'Linha2']

In [25]:
df1 = pd.DataFrame(data = data, index = index)

In [26]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [27]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [28]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [29]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [30]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [31]:
df2 = pd.DataFrame(data = data)

In [32]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [33]:
data = [(1,2,3), 
        (4,5,6), 
        (7,8,9)]

In [34]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [35]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [36]:
df1[df1>0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [37]:
df2[df2>0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [38]:
df3[df3>0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [40]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [41]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C